<?php

return [

    'success' => 'درخواست شما با موفقیت انجام شد',

    'accessToken' => [
        'valid'   => 'توکن معتبر است',
        'invalid' => 'توکن نامعتبر است',
    ],

    'code' => [
        'success' => 'اس ام اس حاوی کد با موفقیت ارسال شد',
        'expires' => 'کد منقضی شده است',
    ],

    'data' => [
        'list'               => 'لیست اطلاعات با موفقیت ارسال شد',
        'show'               => 'اطلاعات با موفقیت ارسال شد',
        'invalid_data_input' => 'داده ای ارسالی اشتباه است',
    ],

    'auth' => [
        'guest'             => [
            'signError' => 'اپلیکیشن نامعتبر است',
            'success'   => 'ورود به صورت مهمان با موفقیت انجام شد',
        ],
        'code'              => [
            'expires'      => 'کد موقت منقضی شده است',
            'invalid'      => 'کد موقت نامعتبر است',
            'limit_minute' => 'برای دریافت کد جدید :minute دقیقه منتظر بمانید',
            'used'         => 'کد موقت قبلا استفاده شده است',
            'success'      => 'به فروشگاه خوش آمدید',
        ],
        'invalidResetToken' => 'توکن بازیابی رمز اشتباه است',
        'logout'            => 'خروج با موفقیت انجام شد',
        'firebase'          => 'توکن با موفقیت بروزرسانی شد',
        'refresh_token'     => 'توکن های جدید ارسال شد',
        'update_profile'    => 'اطلاعات پروفایل شما با موفقیت بروزرسانی شد',
        'change_password'   => 'گذرواژه شما با موفقیت بروزرسانی شد',
    ],

    'notification' => [
        'product' => [
            'available' => 'محصول :title موجود شد هم اکنون می توانید از فروشگاه فروشگاه خرید کنید باتشکر'
        ]
    ],

    'acl' => [
        'permission_sync'         => 'مجوزهای مربوطه بروزرسانی شد',
        'role_sync'               => 'سطح دسترسی مربوطه بروزرسانی شد',
        'new_admin'               => 'کاربر ادمین با موفقیت ایجاد شد',
        'update_admin'            => 'کاربر ادمین با موفقیت بروزرسانی شد',
        'active_admin'            => 'وضعیت کاربر ادمین با موفقیت بروزرسانی شد',
        'active_admin_not_access' => 'بروزرسانی وضعیت کاربر ادمین امکان پذیر نیست',
        'user_not_role'           => 'کاربر سطح دسترسی دارا نیست',
    ],

    'user' => [
        'api_info'    => 'اطلاعات کاربر با موفقیت دریافت شد',
        'api_role'    => 'نقش کاربر با موفقیت بروزسانی شد',
        'api_store'   => 'کاربر جدید با موفقیت ذخیره شد',
        'api_destroy' => 'کاربر با موفقیت حذف شد',
        'api_updated' => 'کاربر با موفقیت بروزرسانی شد',
    ],

    'role' => [
        'api_sync'        => 'مجوز های مربوطه با موفقیت بروزرسانی شد',
        'api_create'      => 'نقش کاربری با موفقیت ذخیره شد',
        'api_update'      => 'نقش کاربری با موفقیت بروزرسانی شد',
        'api_destroy'     => 'نقش کاربری با موفقیت حذف شد',
        'api_destroy_not' => 'نقش کاربری قابل حذف نیست',
    ],

    'province' => [
        'api_create'  => 'استان با موفقیت ذخیره شد',
        'api_update'  => 'استان با موفقیت بروزرسانی شد',
        'api_destroy' => 'استان با موفقیت حذف شد',
    ],

    'county' => [
        'api_create'  => 'شهرستان با موفقیت ذخیره شد',
        'api_update'  => 'شهرستان با موفقیت بروزرسانی شد',
        'api_destroy' => 'شهرستان با موفقیت حذف شد',
    ],

    'city' => [
        'api_create'  => 'شهر با موفقیت ذخیره شد',
        'api_update'  => 'شهر با موفقیت بروزرسانی شد',
        'api_destroy' => 'شهر با موفقیت حذف شد',
    ],

    'brand' => [
        'api_create'  => 'برند با موفقیت ذخیره شد',
        'api_update'  => 'برند با موفقیت بروزرسانی شد',
        'api_destroy' => 'برند با موفقیت حذف شد',
    ],

    'category' => [
        'api_create'      => 'دسته بندی با موفقیت ذخیره شد',
        'api_update'      => 'دسته بندی با موفقیت بروزرسانی شد',
        'api_destroy'     => 'دسته بندی با موفقیت حذف شد',
        'api_destroy_not' => 'دسته بندی شامل زیر شاخه می باشد. حذف امکان پذیر نیست',
    ],

    'product' => [
        'api_create'  => 'محصول با موفقیت ذخیره شد',
        'api_update'  => 'محصول با موفقیت بروزرسانی شد',
        'api_destroy' => 'محصول با موفقیت حذف شد',
        'api_status'  => 'وضعیت محصول با موفقیت بروزرسانی شد',
    ],

    'attributeGroup' => [
        'api_create'  => 'گروه خصوصیات با موفقیت ذخیره شد',
        'api_update'  => 'گروه خصوصیات با موفقیت بروزرسانی شد',
        'api_destroy' => 'گروه خصوصیات با موفقیت حذف شد',
    ],

    'attribute' => [
        'api_create'  => 'خصوصیت با موفقیت ذخیره شد',
        'api_update'  => 'خصوصیت با موفقیت بروزرسانی شد',
        'api_destroy' => 'خصوصیت با موفقیت حذف شد',

        'types' => [
            'text'       => 'تکست',
            'check_box'  => 'چک باکس',
            'select_box' => 'سلکت باکس',
        ]
    ],

    'attributeItem' => [
        'api_create'  => 'آیتم خصوصیت با موفقیت ذخیره شد',
        'api_update'  => 'آیتم خصوصیت با موفقیت بروزرسانی شد',
        'api_destroy' => 'آیتم خصوصیت با موفقیت حذف شد',
    ],

    'address' => [
        'api_create'  => 'آدرس با موفقیت ذخیره شد',
        'api_update'  => 'آدرس با موفقیت بروزرسانی شد',
        'api_destroy' => 'آدرس با موفقیت حذف شد',
    ],

    'banner' => [
        'api_create'  => 'بنر با موفقیت ذخیره شد',
        'api_update'  => 'بنر با موفقیت بروزرسانی شد',
        'api_destroy' => 'بنر با موفقیت حذف شد',
    ],


];
